Repository: umeshshingare/Password_Pusher
Catalog: config/locales/gettext/*/app.po
Languages: ga

source: This data contained here will expire after
ga: Rachaidh an fhaisnéis seo atá anseo in éag tar éis

source: Your Secret Link
ga: Do Nasc Rúnda

source: The following files have been sent to you.
ga: Tá na comhaid seo a leanas seolta chugat.

source: Please download and store in a secure area.
ga: Íoslódáil agus stóráil in áit shábháilte le do thoil.

source: The following message has been sent to you along with the files below.
ga: Tá an teachtaireacht seo a leanas seolta chugat mar aon leis na comhaid thíos.

source: The message is blurred out. Click below to reveal it.
ga: Tá an teachtaireacht doiléir. Cliceáil thíos chun í a thaispeáint.

source: 0 more views
ga: 0 radharc eile

source: (this is the last view).
ga: (seo an radharc deireanach).

source: more view
ga: tuilleadh radhairc

source: (whichever occurs first).
ga: (cibé acu a tharlaíonn ar dtús).

source: Delete This Secret Link Now
ga: Scrios an Nasc Rúnda seo Anois

source: Delete?
ga: Scrios?

source: This will expire this secret link and
ga: Cuirfidh sé seo an nasc rúnda seo in éag agus

source: delete all related content from the database forever
ga: scrios an t-ábhar gaolmhar go léir ón mbunachar sonraí go deo

source: Your Secret Link Has Expired
ga: Tá do Nasc Rúnda imithe in éag

source: We apologize but this secret link has expired.
ga: Gabhaimid leithscéal ach tá an nasc rúnda seo imithe in éag.

source: If needed, please contact the person or organization who gave you this secret URL.
ga: Más gá, déan teagmháil leis an duine nó leis an eagraíocht a thug an URL rúnda seo duit.

source: Browser cookies help make this tool work. By using it, you agree the use of these cookies.
ga: Cuidíonn fianáin brabhsálaí leis an uirlis seo a oibriú. Trí úsáid a bhaint as, aontaíonn tú le húsáid na bhfianán seo.

source: Dashboard
ga: Painéal Rialaithe

source: All
ga: Gach

source: New
ga: Nua

source: Peter
ga: Peadar

source: Front Page
ga: Leathanach Tosaigh

source: Docker Containers
ga: Coimeádáin Docker

source: FAQ
ga: Ceisteanna Coitianta

source: JSON API
ga: API JSON

source: Key Generator
ga: Gineadóir Eochrach

source: Source Code
ga: Cód Foinse

source: Tools
ga: Uirlisí

source: Overview
ga: Forbhreathnú

source: Documentation
ga: Doiciméadú

source: Account
ga: Cuntas

source: Admin Dashboard
ga: Painéal Riaracháin

source: Edit Login Details
ga: Cuir Sonraí Logála Isteach in Eagar

source: Log Out
ga: Logáil Amach

source: Log In
ga: Logáil Isteach

source: Sign Up
ga: Cláraigh

source: Configure Password Generation
ga: Cumraigh Giniúint Pasfhocal

source: Test Area
ga: Limistéar Tástála

source: Number of Syllables
ga: Líon na Siollaí

source: Minimum Syllable Length
ga: Fad Íosta Siolla

source: Maximum Syllable Length
ga: Fad Uasta na Siollaí

source: Include numbers
ga: Cuir uimhreacha san áireamh

source: Use Titlecase
ga: Úsáid Cás Teidil

source: Use Separators
ga: Úsáid Deighilteoirí

source: Test
ga: Tástáil

source: Separators
ga: Deighilteoirí

source: Vowels
ga: Gutaí

source: Consonants
ga: Consain

source: Reset to Defaults
ga: Athshocraigh go Réamhshocruithe

source: Passwords
ga: Pasfhocail

source: Files
ga: Comhaid

source: URLs
ga: URLanna

source: QR Codes ᴮᴱᵀᴬ
ga: Cóid QR ᴮᴱᵀᴬ
