Repository: umeshshingare/Password_Pusher
Catalog: config/locales/gettext/*/app.po
Languages: ga

source: Secret Link Language
ga: Teanga Nasc Rúnda

source: Copy to Clipboard
ga: Cóipeáil chuig an nGearrthaisce

source: Password Pusher is an application to securely send passwords over the web. Links to passwords expire after a certain number of views and/or time has passed.
ga: Is feidhmchlár é Password Pusher chun pasfhocail a sheoladh go slán ar an ngréasán. Rachaidh naisc chuig pasfhocail in éag tar éis líon áirithe radharcanna agus/nó am a bheith caite.

source: Confirm your new account
ga: Deimhnigh do chuntas nua

source: Your account has been created but you must confirm that you own this email address.
ga: Tá do chuntas cruthaithe ach ní mór duit a dheimhniú gur leatsa an seoladh ríomhphoist seo.

source: You can confirm your account email by
ga: Is féidir leat ríomhphost do chuntais a dheimhniú trí

source: by clicking this link
ga: trí chliceáil ar an nasc seo

source: or by copying and pasting the following URL into your browser:
ga: nó tríd an URL seo a leanas a chóipeáil agus a ghreamú isteach i do bhrabhsálaí:

source: If you didn't create an account, no action is required.
ga: Mura chruthaigh tú cuntas, níl aon ghníomh ag teastáil.

source: Your email is being changed
ga: Tá do ríomhphost á athrú

source: We're contacting you to notify you that your email at
ga: Táimid ag teagmháil leat chun a chur in iúl duit go bhfuil do sheoladh ríomhphoist ag

source: is being changed to %s
ga: á athrú go %s

source: has been changed to %s
ga: athraithe go %s

source: Password Change
ga: Athrú Pasfhocail

source: We're contacting you to notify you that your password has been changed on
ga: Táimid ag teagmháil leat chun a chur in iúl duit gur athraíodh do phasfhocal ar

source: If you didn't initiate this and it wasn't your intention, please contact us as soon as possible.
ga: Mura tusa a chuir tús leis seo agus mura raibh sé i gceist agat é a dhéanamh, déan teagmháil linn a luaithe is féidir.

source: Password Change Request
ga: Iarratas ar Athrú Pasfhocail

source: Someone has requested a link to change your password. You can proceed with this action
ga: D'iarr duine éigin nasc chun do phasfhocal a athrú. Is féidir leat dul ar aghaidh leis an ngníomh seo.

source: If you didn't request this change, you can safely delete this email.
ga: Mura d'iarr tú an t-athrú seo, is féidir leat an ríomhphost seo a scriosadh go sábháilte.

source: Your password won't change until you access the link above and create a new one.
ga: Ní athróidh do phasfhocal go dtí go rochtana tú an nasc thuas agus go gcruthóidh tú ceann nua.

source: Unlock Your Account
ga: Díghlasáil Do Chuntas

source: Your account has been locked due to an excessive number of unsuccessful sign in attempts.
ga: Tá do chuntas faoi ghlas mar gheall ar líon iomarcach iarrachtaí logála isteach nár éirigh leo.

source: Click this link
ga: Cliceáil an nasc seo

source: to unlock your account or by copying and pasting the following URL into your browser:
ga: chun do chuntas a dhíghlasáil nó tríd an URL seo a leanas a chóipeáil agus a ghreamú isteach i do bhrabhsálaí:

source: New password
ga: Pasfhocal nua

source: Confirm new password
ga: Deimhnigh an focal faire nua

source: A minimum of %d characters is required but the more the better.
ga: Tá %d carachtar ar a laghad ag teastáil ach dá mhéad is amhlaidh is fearr.

source: Change Email
ga: Athraigh Ríomhphost

source: Current Password
ga: Pasfhocal Reatha

source: API Token
ga: Comhartha API

source: This token is specific to your account. It can be used with command line applications, the JSON API, 3rd party integrations and more.
ga: Tá an comhartha seo sainiúil do do chuntas. Is féidir é a úsáid le feidhmchláir líne ordaithe, an JSON API, comhtháthú tríú páirtí agus tuilleadh.

source: Make sure to keep this token secure. It provides full access to your account.
ga: Bí cinnte an comhartha seo a choinneáil slán. Tugann sé rochtain iomlán ar do chuntas.

source: If needed, you can regenerate a new token below which will invalidate this existing token.
ga: Más gá, is féidir leat comhartha nua a athghiniúint thíos rud a chuirfidh an comhartha atá ann cheana ar neamhní.

source: Copied!
ga: Cóipeáilte!

source: Your API token is blurred out. Click below to reveal it.
ga: Tá do chomhartha API doiléir. Cliceáil thíos chun é a thaispeáint.

source: To delete this token and regenerate a new one, use the button below.
ga: Chun an comhartha seo a scriosadh agus ceann nua a athghiniúint, bain úsáid as an gcnaipe thíos.

source: Note that this will invalidate any tools that may be using the existing key and will have to be updated with the new token.
ga: Tabhair faoi deara go gcuirfidh sé seo aon uirlisí a d'fhéadfadh a bheith ag baint úsáide as an eochair atá ann cheana ar neamhní agus go gcaithfear iad a nuashonrú leis an gcomhartha nua.

source: Regenerate Token
ga: Athghin Comhartha

source: Delete and generate a new API token?
ga: Scrios agus comhartha API nua a ghiniúint?

source: This will delete this token and
ga: Scriosfaidh sé seo an comhartha seo agus

source: invalidate any tools that may be using it
ga: aon uirlisí a d'fhéadfadh a bheith á úsáid a chur ar neamhní

source: A new token will be generated in its place.
ga: Ginfear comhartha nua ina áit.

source: Are you sure?
ga: An bhfuil tú cinnte?

source: Cancel
ga: Cealaigh

source: Delete & Regenerate
ga: Scrios & Athghin

source: Processing...
ga: Ag próiseáil...

source: Email
ga: Ríomhphost

source: Password
ga: Pasfhocal

source: Password Pusher Logo
ga: Lógó Brúiteoir Pasfhocal

source: About Password Pusher
ga: Maidir le Brúiteoir Pasfhocal

source: About
ga: Maidir

source: Password Pusher is a tool used for sharing passwords and other sensitive information with other people securely.
ga: Is uirlis é Password Pusher a úsáidtear chun pasfhocail agus faisnéis íogair eile a roinnt le daoine eile go slán.

source: With Password Pusher, you can create a unique, one-time URL that will expire after a certain amount of time or after it has been accessed a certain number of times, ensuring that your information remains private and secure.
ga: Le Password Pusher, is féidir leat URL uathúil, aonuaire a chruthú a rachaidh in éag tar éis tréimhse áirithe ama nó tar éis rochtain a fháil air líon áirithe uaireanta, rud a chinntíonn go bhfanfaidh d’fhaisnéis príobháideach agus slán.

source: It is often used by individuals and organizations to share login credentials or other sensitive data with colleagues, clients, or partners.
ga: Is minic a úsáideann daoine aonair agus eagraíochtaí é chun dintiúir logála isteach nó sonraí íogaire eile a roinnt le comhghleacaithe, cliaint nó comhpháirtithe.

source: Password Pusher is a simple and convenient solution for securely sharing passwords without the need for email or other less secure communication methods.
ga: Is réiteach simplí agus áisiúil é Password Pusher chun pasfhocail a roinnt go slán gan gá le ríomhphost ná modhanna cumarsáide eile nach bhfuil chomh slán.

source: Hosted at
ga: Arna óstáil ag

source: or you can run your own private instance wherever you like.
ga: nó is féidir leat do chás príobháideach féin a rith cibé áit is mian leat.

source: The source code is
ga: Is é an cód foinse

source: on Github
ga: ar Github

source: It’s opensource and free for anyone to use, review or modify.
ga: Tá sé foinse oscailte agus saor in aisce d’aon duine a úsáid, a athbhreithniú nó a mhodhnú.

source: The Author
ga: An tÚdar

source: My name is Peter Giacomo Lombardo. You can find me on
ga: Is mise Peter Giacomo Lombardo. Is féidir leat mé a fháil ar

source: or
ga: nó

source: For updates, you can
ga: Le haghaidh nuashonruithe, is féidir leat

source: follow me on Twitter
ga: lean mé ar Twitter

source: Want to Help Out?
ga: Ar mhaith leat cabhrú?

source: By far the biggest help is to spread the word
ga: Is é an chabhair is mó ná an scéal a scaipeadh

source: Share and suggest Password Pusher to colleagues and friends.
ga: Roinn agus mol Pasfhocal Brúiteoir do chomhghleacaithe agus do chairde.

source: You can also
ga: Is féidir leat freisin

source: Star the Github project
ga: Cuir réalta ar thionscadal Github

source: It's gasoline for the algos that trend Password Pusher.
ga: Is gásailín é do na halgartaim a threoraíonn Password Pusher.

source: Sign up for the
ga: Cláraigh don

source: newsletter
ga: nuachtlitir

source: to get updates on important releases, security issues, tips and more.
ga: chun nuashonruithe a fháil ar eisiúintí tábhachtacha, saincheisteanna slándála, leideanna agus tuilleadh.

source: Follow Password Pusher on
ga: Lean Pasfhocal Brúiteoir ar

source: and
ga: agus

source: Fix an issue, add a feature or write some documentation.
ga: Deisigh fadhb, cuir gné leis nó scríobh roinnt doiciméadachta.

source: See the Github project.
ga: Féach ar thionscadal Github.

source: Sign up to Digital Ocean
ga: Cláraigh le haghaidh Aigéan Digiteach

source: with this link
ga: leis an nasc seo

source: to get Password Pusher a hosting credit.
ga: chun creidmheas óstála a fháil ó Password Pusher.

source: Thank you for supporting Password Pusher!
ga: Go raibh maith agat as tacú le Password Pusher!

source: Resources
ga: Acmhainní

source: If you are giving a presentation, authoring a blog post or video about Password Pusher, feel free to contact me for any questions.
ga: Más rud é go bhfuil tú ag tabhairt cur i láthair, ag scríobh post blag nó físeáin faoi Password Pusher, bíodh leisce ort teagmháil a dhéanamh liom le haon cheisteanna.

source: We have media resources and a full explanation of features available in
ga: Tá acmhainní meán againn agus míniú iomlán ar na gnéithe atá ar fáil i

source: Mac Keynote
ga: Príomhóráid Mac

source: formats.
ga: formáidí.

source: Birthday
ga: Breithlá

source: More Than 11 Years Old
ga: Níos mó ná 11 bliana d'aois

source: The first git commit to Password Pusher was on
ga: Bhí an chéad tiomantas git chuig Password Pusher ar siúl

source: pwpush.com went live shortly thereafter.
ga: Chuaigh pwpush.com beo go gairid ina dhiaidh sin.

source: The Original Theme
ga: An Téama Bunaidh

source: The original site design consisted of a dark background with a bold yellow font.
ga: Bhí cúlra dorcha le cló buí trom ar dhearadh bunaidh an tsuímh.

source: Follow for news, changes & updates.
ga: Lean le haghaidh nuachta, athruithe & nuashonruithe.

source: Generate Key
ga: Gin Eochair

source: Generate an Encryption Key
ga: Gin Eochair Chriptithe

source: This page is used as a helper tool to generate a random encryption key for privately hosted instances of Password Pusher.
ga: Úsáidtear an leathanach seo mar uirlis chúnta chun eochair chriptithe randamach a ghiniúint le haghaidh samplaí príobháideacha de Password Pusher.

source: Password Pusher encrypts sensitive data in the database. This requires a randomly generated encryption key for each application instance.
ga: Criptíonn Password Pusher sonraí íogaire sa bhunachar sonraí. Éilíonn sé seo eochair chriptithe a ghintear go randamach do gach cás feidhmchláir.

source: You can use the randomly generated code below to configure your Password Pusher instance.
ga: Is féidir leat an cód a ghintear go randamach thíos a úsáid chun d’eispéireas Pasfhocal Brúiteora a chumrú.

source: Generated Encryption Key
ga: Eochair Chriptithe Ginte

source: You can apply this key to your application by setting the environment variable
ga: Is féidir leat an eochair seo a chur i bhfeidhm ar d'fheidhmchlár tríd an athróg timpeallachta a shocrú

source: Reload this page to re-generate a new key.
ga: Athlódáil an leathanach seo chun eochair nua a athghiniúint.

source: Notes:
ga: Nótaí:

source: If an encryption key isn't provided, a default key will be used.
ga: Mura gcuirtear eochair chriptithe ar fáil, úsáidfear eochair réamhshocraithe.

source: The best security for private instances of Password Pusher is to use your own custom encryption key although it is not required.
ga: Is é an tslándáil is fearr le haghaidh cásanna príobháideacha de Password Pusher ná d’eochair chriptithe saincheaptha féin a úsáid cé nach bhfuil sé riachtanach.

source: The risk in using the default key is lessened if you keep your instance secure and your push expirations short. e.g. 1 day/1 view versus 100 days/100 views.
ga: Laghdaítear an riosca a bhaineann leis an eochair réamhshocraithe a úsáid má choinníonn tú do chás slán agus má bhíonn do thréimhse éaga brú gearr. m.sh. 1 lá/1 amharc i gcomparáid le 100 lá/100 amharc.

source: Once a push expires, all encrypted data is deleted.
ga: Nuair a théann brú in éag, scriostar na sonraí criptithe go léir.

source: Changing an encryption key where old pushes already exist will make those older pushes unreadable. In other words, the payloads will be garbled. New pushes going forward will work fine.
ga: Má athraítear eochair chriptithe i gcás ina bhfuil sean-bhrúnna ann cheana féin, ní bheidh na sean-bhrúnna sin inléite. Is é sin le rá, beidh na hualaí mearbhall. Oibreoidh brúnna nua amach anseo go breá.

source: Key generation can also be done from the command line in the application source by executing:
ga: Is féidir eochracha a ghiniúint ón líne ordaithe i bhfoinse an fheidhmchláir freisin tríd an méid seo a leanas a fhorghníomhú:

source: See also the Password Pusher
ga: Féach freisin ar an mBrúiteoir Pasfhocal

source: Configuration documentation
ga: Doiciméadacht chumraíochta

source: Securely Send Files
ga: Seol Comhaid go Slán

source: Day
ga: Lá

source: Days
ga: Laethanta

source: View
ga: Amharc

source: Views
ga: Radharcanna

source: Save
ga: Sábháil

source: Saved!
ga: Sábháilte!

source: Add Files...
ga: Cuir Comhaid leis...

source: Expire secret link and delete after:
ga: Cuir an nasc rúnda in éag agus scrios tar éis:

source: (whichever comes first)
ga: (cibé acu a thagann ar dtús)

source: Use a 1-click retrieval step
ga: Bain úsáid as céim aisghabhála 1-cliceáil

source: Helps to avoid chat systems and URL scanners from eating up views.
ga: Cabhraíonn sé le córais comhrá agus scanóirí URL a sheachaint ó radharcanna a ithe.

source: Allow immediate deletion
ga: Ceadaigh scriosadh láithreach

source: Allow users to delete this push once retrieved.
ga: Ceadaigh d'úsáideoirí an bhrú seo a scriosadh a luaithe a aisghabhfar é.

source: Passphrase Lockdown
ga: Glasáil Frása Faire

source: Optional: Require recipients to enter a passphrase to view this push
ga: Roghnach: Éiligh ar fhaighteoirí frása faire a iontráil chun an fógra seo a fheiceáil

source: the above settings as the page default.
ga: na socruithe thuas mar réamhshocrú an leathanaigh.

source: Optional
ga: Roghnach

source: A name shown in the dashboard, notifications and emails.
ga: Ainm a thaispeántar sa phainéal rialaithe, i bhfógraí agus i ríomhphoist.

source: Message
ga: Teachtaireacht

source: Optional: A message to be included with the push
ga: Roghnach: Teachtaireacht le cur san áireamh leis an mbrú

source: Encrypted and visible to the receiving party
ga: Criptithe agus infheicthe ag an bpáirtí a fhaigheann é

source: Reference Note
ga: Nóta Tagartha

source: Encrypted and visible only to you
ga: Criptithe agus le feiceáil agatsa amháin

source: Once expired, all files and content of the push will be deleted immediately and entirely.
ga: Nuair a bheidh sé imithe in éag, scriosfar gach comhad agus ábhar an bhrú láithreach agus go hiomlán.

source: An audit log of activity will be available.
ga: Beidh log iniúchta gníomhaíochta ar fáil.

source: Push It!
ga: Brúigh é!

source: Securely Send a Password
ga: Seol Pasfhocal go Slán

source: Enter the Password or Text to push...
ga: Cuir isteach an Pasfhocal nó an Téacs le brú...

source: Characters
ga: Carachtair

source: Generate Password
ga: Gin Pasfhocal

source: Use the button above to generate a random password.
ga: Úsáid an cnaipe thuas chun pasfhocal randamach a ghiniúint.

source: Tip: Only enter a password into the box. Other identifying information can compromise security.
ga: Leid: Ná cuir isteach ach pasfhocal sa bhosca. Is féidir le faisnéis aitheantais eile an tslándáil a chur i mbaol.

source: All passwords are encrypted prior to storage and are available to only those with the secret link. Once expired, encrypted passwords are unequivocally deleted from the database.
ga: Déantar gach focal faire a chriptiú roimh stóráil agus níl siad ar fáil ach dóibh siúd a bhfuil an nasc rúnda acu. Nuair a bhíonn siad imithe in éag, scriostar pasfhocail chriptithe go hiomlán ón mbunachar sonraí.

source: Securely Send a QR Code
ga: Seol Cód QR go Slán

source: Enter up to 1024 characters...
ga: Cuir isteach suas le 1024 carachtar...

source: Please obtain and securely store this content in a secure manner, such as in a password manager.
ga: Faigh agus stóráil an t-ábhar seo go slán ar bhealach slán, amhail i mbainisteoir pasfhocal.

source: Your password is blurred out. Click below to reveal it.
ga: Tá do phasfhocal doiléir. Cliceáil thíos chun é a thaispeáint.

source: Securely Send URLs
ga: Seol URLanna go Slán

source: URL Redirection
ga: Atreorú URL

source: Enter the URL to redirect to...
ga: Cuir isteach an URL le hathsheoladh chuici...

source: Helps to avoid chat systems and URL scanners from eating up redirects.
ga: Cabhraíonn sé le córais comhrá agus scanóirí URL a sheachaint ó atreoruithe a ithe.

source: A secret URL will be generated that will redirect to the URL specified.
ga: Ginfear URL rúnda a atreoróidh chuig an URL sonraithe.

source: Upon expiration, the push URL will be deleted entirely.
ga: Nuair a bheidh an dáta éaga, scriosfar an URL brúite go hiomlán.

source: Audit Log for %{push_id}
ga: Log Iniúchta do %{push_id}

source: Pushed on %{date}
ga: Brúite ar %{date}

source: Secret URL for this push
ga: URL rúnda don bhrú seo

source: Visible Only To You
ga: Le feiceáil agatsa amháin

source: None
ga: Dada

source: Settings
ga: Socruithe

source: Expire after
ga: Rachaidh in éag tar éis

source: The push expires after this number of views.
ga: Rachaidh an brú in éag tar éis an líon seo radharcanna.

source: The push expires after this number of days.
ga: Rachaidh an bhrú in éag tar éis an líon seo laethanta.

source: Deletable by Viewers
ga: Is féidir le lucht féachana a scriosadh

source: True
ga: Fíor

source: False
ga: Bréagach

source: This allows end users to delete content once retrieved.
ga: Ligeann sé seo d’úsáideoirí deiridh ábhar a scriosadh a luaithe a aisghabhtar é.

source: 1-click Retrieval Step
ga: Céim Aisghabhála 1-chliceáil

source: No
ga: Níl

source: Yes
ga: Tá

source: Require recipients to enter a passphrase to view this push.
ga: Éiligh ar fhaighteoirí frása faire a iontráil chun an fógra seo a fheiceáil.

source: Current Status
ga: Stádas Reatha

source: State:
ga: Stát:

source: Expired
ga: Imithe in éag

source: The push content has been deleted and the secret URL expired.
ga: Scriosadh an t-ábhar brúite agus chuaigh an URL rúnda in éag.

source: Active
ga: Gníomhach

source: Active and still available for viewing.
ga: Gníomhach agus fós ar fáil le breathnú air.

source: Successful Views
ga: Radharcanna Rathúla

source: The number of times this push has been viewed before expiration.
ga: Líon na n-uaireanta a breathnaíodh ar an mbrú seo roimh dhul in éag.

source: Failed View Attempts
ga: Iarrachtaí Amhairc Theipthe

source: The number of times this push has been viewed after expiration.
ga: Líon na n-uaireanta a breathnaíodh ar an mbrú seo tar éis dó a bheith caite.

source: Days Remaining
ga: Laethanta atá fágtha

source: Number of days until this push expires if the maximum view count isn't reached.
ga: Líon na laethanta go dtí go rachaidh an fógra seo in éag mura sroichtear an líon uasta radharcanna.

source: Payload
ga: Ualach

source: Contains Message for Receiver
ga: Tá Teachtaireacht ann don Ghlacadóir

source: Deleted
ga: Scriosta

source: Has a text payload been added to this push?
ga: An bhfuil ualach téacs curtha leis an bhfógra seo?

source: Message Length
ga: Fad an Teachtaireachta

source: Not Applicable
ga: Ní Bhaineann

source: The length of the attached text payload.
ga: Fad an ualaigh téacs atá ceangailte.

source: Number of Files Attached
ga: Líon na gComhad Ceangailte

source: The number of files attached to this push. This value will be 0 when expired.
ga: Líon na gcomhad atá ceangailte leis an bhfógra seo. Beidh an luach seo 0 nuair a bheidh sé imithe in éag.

source: Attached Files
ga: Comhaid Ceangailte

source: Filename:
ga: Ainm comhaid:

source: Size:
ga: Méid:

source: All attached files have been deleted.
ga: Scriosadh na comhaid ceangailte go léir.

source: Expire Now
ga: Éagaigh Anois

source: Delete This Push?
ga: Scrios an Bhrú seo?

source: This will expire this secret link and
ga: Cuirfidh sé seo an nasc rúnda seo in éag agus

source: remove all content from the database forever
ga: bain an t-ábhar go léir as an mbunachar sonraí go deo

source: The audit log (including future attempted views) will still be maintained going forward.
ga: Coinneofar an log iniúchta (lena n-áirítear iarracht ar amharc sa todhchaí) fós feasta.

source: Delete
ga: Scrios

source: Start of Audit Log
ga: Tús Log Iniúchta

source: As the push receives activity, a log of each with identifying information will show up here.
ga: De réir mar a gheobhaidh an brú gníomhaíocht, taispeánfar log de gach ceann acu anseo, ina mbeidh faisnéis aitheantais ann.

source: End of Audit Log
ga: Deireadh Log Iniúchta

source: Active Pushes
ga: Brú Gníomhach

source: You currently have no active pushes.
ga: Níl aon bhrúnna gníomhacha agat faoi láthair.

source: You currently have no expired pushes.
ga: Níl aon bhrúnna imithe in éag agat faoi láthair.

source: You currently have no pushes.
ga: Níl aon bhrúnna agat faoi láthair.

source: Push a Password Now
ga: Brúigh Pasfhocal Anois

source: Expired Pushes
ga: Pusanna atá imithe in éag

source: All Pushes
ga: Gach Brú

source: Created
ga: Cruthaithe

source: Note
ga: Nóta

source: File(s)
ga: Comhad(anna)

source: QR Code
ga: Cód QR

source: Text
ga: Téacs

source: Push Controls
ga: Rialuithe Brúigh

source: Preview
ga: Réamhamharc

source: Audit
ga: Iniúchadh

source: Enter The Secret Passphrase
ga: Cuir isteach an Pasfrása Rúnda

source: Enter the secret passphrase provided with this URL
ga: Cuir isteach an frása faire rúnda a chuirtear ar fáil leis an URL seo

source: Enter the secret passphrase
ga: Cuir isteach an frása faire rúnda

source: Go
ga: Téigh

source: Click Here to Proceed
ga: Cliceáil Anseo le Dul Ar Aghaidh

source: Your Push Has Been Created
ga: Tá do Bhrú Cruthaithe

source: Your push has been created.
ga: Tá do bhrú cruthaithe.

source: Use this secret link to share it:
ga: Úsáid an nasc rúnda seo chun é a roinnt:

source: Print & Share
ga: Priontáil & Comhroinn

source: Generate a Printable Page for End Users
ga: Gin Leathanach Inphriontáilte d'Úsáideoirí Deiridh

source: Optional Custom Message
ga: Teachtaireacht Saincheaptha Roghnach

source: Show Expiration Details
ga: Taispeáin Sonraí Éaga

source: Include ID
ga: Cuir aitheantas san áireamh

source: Generate
ga: Gin

source: This secret link and all content will be deleted in
ga: Scriosfar an nasc rúnda seo agus an t-ábhar go léir i

source: day
ga: lá

source: view
ga: radharc

source: can be
ga: is féidir a bheith

source: deleted by viewers.
ga: scriosta ag lucht féachana.

source: can NOT be
ga: NÍ féidir a bheith

source: It also includes a
ga: Áirítear leis freisin

source: 1-click preliminary retrieval step
ga: Céim réamhaisghabhála 1-chliceáil

source: View This Push Now
ga: Féach ar an mBrú seo Anois

source: (will burn a view) or
ga: (dófaidh radharc) nó

source: Push Another
ga: Brúigh Ceann Eile

source: View Audit Log
ga: Féach ar Log Iniúchta

source: Your Secret URL
ga: Do URL Rúnda
